import os
from pathlib import Path

from dotenv import load_dotenv

load_dotenv()


class Settings:
    # Авторизационные данные API

    AUTHENTICATION = {
        'GIGACHAT_API_AUTH': os.getenv("GIGACHAT_API_AUTH"),
        'TAVILY_API_KEY': os.getenv("TAVILY_API_KEY"),
        'TELEGRAM_API_ID': os.getenv("TELEGRAM_API_ID"),
        'TELEGRAM_API_HASH': os.getenv("TELEGRAM_API_HASH"),
        'PHONE_NUM': os.getenv("PHONE_NUM"),
        'OPENROUTER_AI_MODEL': os.getenv("OPENROUTER_AI_MODEL"),
        'TOGETHER_API_KEY': os.getenv("TOGETHER_API_KEY"),
        'GOOGLE_CLOUD_API_KEY': os.getenv("GOOGLE_CLOUD_API_KEY")
    }

    # Настройки парсеров
    GOOGLE_SEARCH_LIMIT = 5
    TAVILY_LIMIT = 5

    TRUSTED_WEB_SOURCE = ["ria.ru", "tass.ru", "rbc.ru", "vedomosti.ru", "kommersant.ru", "rg.ru", 'realty.rbc.ru',
                          'gipernn.ru', 'pravda-nn.ru', 'vremyan.ru', 'government-nnov.ru', 'nn.rbc.ru',
                          'domostroynn.ru', 'rbcrealty.ru']
    AVAILABLE_SOURCES = ['Telegram', 'Google', 'Tavily']

    # REGION_KEYWORDS = {
    #     "Нижегородская область": ["нижний новгород", "нижегород", "н.новгород"],
    #     "Москва": ["москва", "мск", "московский"],
    #     "Краснодарский край": ["краснодар", "краснодарский", "крд", "кубань"],
    #     "Санкт-Петербург": ["санкт-петербург", "питер", "спб", "петербург"],
    #     "Чеченская Республика": ["чечня", "чеченская", "грозный", "грз", "чечен", "чр"]
    # }
    REGION_KEYWORDS = {
        "Нижегородская область": ["нижний новгород", "нижегород", "н.новгород"],
        "г. Москва": ["москва", "мск", "московский", "столица", "москвич"],
        "г. Санкт-Петербург": ["санкт-петербург", "питер", "спб", "петербург", "ленинград", "ленобл"],
        "Краснодарский край": ["краснодар", "краснодарский", "крд", "кубань", "краснодарский край"],
        "Чеченская Республика": ["чечня", "грозный", "грз", "чечен"],
        "Вологодская область": ["вологда", "вологодская", "вологодский", "вологодчина"],
        "Воронежская область": ["воронеж", "воронежская", "воронежский", "вро"],
        "г. Севастополь": ["севастополь", "севастопольский", "сева", "крымсевастополь"],
        "Еврейская автономная область": ["еврейская", "еао", "биробиджан", "еврейская автономия"],
        "Забайкальский край": ["забайкал", "забайкальский", "чита", "читинская область"],
        "Ивановская область": ["иваново", "ивановская", "ивановский", "иванов"],
        "Иркутская область": ["иркутск", "иркутская", "иркутский", "иркут"],
        "Кабардино-Балкарская Республика": ["кабардино-балкария", "кбр", "нальчик", "кабарда", "балкария"],
        "Калининградская область": ["калининград", "калининградская", "кёнигсберг", "калининградский"],
        "Калужская область": ["калуга", "калужская", "калужский", "калуж"],
        "Камчатский край": ["камчатка", "камчатский", "петропавловск-камчатский", "петропавловск"],
        "Карачаево-Черкесская Республика": ["карачаево-черкесия", "кчр", "черкесск", "карачай", "черкесия"],
        "Кемеровская область": ["кемерово", "кемеровская", "кузбасс", "кемеров", "кузнецкий бассейн"],
        "Кировская область": ["киров", "кировская", "кировский", "вятка", "киров"],
        "Костромская область": ["кострома", "костромская", "костромской", "костромич"],
        "Красноярский край": ["красноярск", "красноярский", "краснояр", "край", "красноярье"],
        "Курганская область": ["курган", "курганская", "курганский", "курган"],
        "Курская область": ["курск", "курская", "курский", "курск"],
        "Ленинградская область": ["ленинградская", "ленобласть", "спб область", "ленинград", "ленинградский"],
        "Липецкая область": ["липецк", "липецкая", "липецкий", "липецк"],
        "Магаданская область": ["магадан", "магаданская", "магаданский"],
        "Московская область": ["московская область", "подмосковье", "московский", "московская", "мск", "москв"],
        "Мурманская область": ["мурманск", "мурманская", "мурманский", "мурман"],
        "Ненецкий автономный округ": ["ненецкий", "нао", "нарьян-мар", "ненецкий округ"],
        "Новгородская область": ["новгород", "новгородская", "великий новгород", "новгородский"],
        "Новосибирская область": ["новосибирск", "новосибирская", "новосибирский", "нск"],
        "Омская область": ["омск", "омская", "омский"],
        "Оренбургская область": ["оренбург", "оренбургская", "оренбургский"],
        "Орловская область": ["орёл", "орловская", "орловский", "орлов"],
        "Пензенская область": ["пенза", "пензенская", "пензенский"],
        "Пермский край": ["пермь", "пермский", "пермский край", "пермское"],
        "Приморский край": ["приморье", "приморский", "владивосток", "приморский край"],
        "Псковская область": ["псков", "псковская", "псковский"],
        "Республика Адыгея": ["адыгея", "адыгейская", "майкоп", "республика адыгея"],
        "Республика Алтай": ["алтай", "горно-алтайск"],
        "Республика Башкортостан": ["башкортостан", "башкирия", "уфа"],
        "Республика Бурятия": ["бурятия", "улан-удэ", "бурятская"],
        "Республика Дагестан": ["дагестан", "махачкала", "дагестанская"],
        "Республика Ингушетия": ["ингушетия", "магас", "ингушская"],
        "Республика Калмыкия": ["калмыкия", "элиста", "калмыцкая"],
        "Республика Карелия": ["карелия", "петрозаводск", "карельская"],
        "Республика Коми": ["коми", "сыктывкар", "ком"],
        "Республика Крым": ["крым", "симферополь", "крымская"],
        "Республика Марий Эл": ["марий эл", "йошкар-ола", "марийская"],
        "Республика Мордовия": ["мордовия", "саранск", "мордов"],
        "Республика Саха (Якутия)": ["якутия", "саха", "якутск"],
        "Республика Северная Осетия": ["северная осетия", "алания", "владикавказ", "осетия"],
        "Республика Татарстан": ["татарстан", "казань", "татарская"],
        "Республика Тыва": ["тыва", "тува", "кызыл", "тыв"],
        "Республика Хакасия": ["хакасия", "абакан" "хакасская", "хакас"],
        "Ростовская область": ["ростов", "ростовская", "ростов-на-дону", "ростовский"],
        "Рязанская область": ["рязань", "рязанская", "рязанский"],
        "Самарская область": ["самара", "самарская", "самарский"],
        "Саратовская область": ["саратов", "саратовская", "саратовский"],
        "Сахалинская область": ["сахалин", "сахалинская", "южно-сахалинск"],
        "Свердловская область": ["свердловская", "екатеринбург", "свердловск"],
        "Смоленская область": ["смоленск", "смоленская", "смоленский"],
        "Ставропольский край": ["ставрополь", "ставропольский", "ставрополье"],
        "Тамбовская область": ["тамбов", "тамбовская", "тамбовский"],
        "Тверская область": ["тверь", "тверская", "тверской"],
        "Томская область": ["томск", "томская", "томский"],
        "Тульская область": ["тула", "тульская", "тульский"],
        "Тюменская область": ["тюмень", "тюменская", "тюменский"],
        "Удмуртская Республика": ["удмуртия", "ижевск", "удмуртская"],
        "Ульяновская область": ["ульяновск", "ульяновская", "ульяновский"],
        "Хабаровский край": ["хабаровск", "хабаровский", "хабаровское"],
        "Ханты-Мансийский автономный округ": ["ханты-мансийск", "ханты-мансийский", "югра", "хмао"],
        "Челябинская область": ["челябинск", "челябинская", "челябинский"],
        "Чувашская Республика": ["чувашия", "чебоксары", "чувашская"],
        "Чукотский автономный округ": ["чукотка", "чукотский", "анадырь"],
        "Ямало-Ненецкий автономный округ": ["ямал", "ямало-ненецкий", "салехард", "янао"],
        "Ярославская область": ["ярославль", "ярославская", "ярославский"],
        "Алтайский край": ["алтайский", "барнаул", "алтай"],
        "Амурская область": ["амурская", "благовещенск", "амурск"],
        "Архангельская область": ["архангельск", "архангельская", "архангельский"],
        "Астраханская область": ["астрахань", "астраханская", "астраханский"],
        "Белгородская область": ["белгород", "белгородская", "белгородский"],
        "Брянская область": ["брянск", "брянская", "брянский"],
        "Владимирская область": ["владимир", "владимирская", "владимирский"],
        "Волгоградская область": ["волгоград", "волгоградская", "волгоградский"]
    }
    # Сумма слов в одной категории должна быть:
    # 26 = 32 (Google поддерживает в одном запросе) - 6 (регион + период + фильтр)
    CATEGORIES_SEARCH = {
        'Недвижимость': [
            'Обзор рынка недвижимости',
            'Спрос на рынке недвижимости',
            'Новости недвижимости',
            'Анализ рынка недвижимости',
            'Новости ипотеки',
            'Тенденции рынка недвижимости'
        ],
        'Цены на недвижимость': [
            'Цены недвижимости',
            'Почему изменилась цена на недвижимость',
            'Факторы изменения цены на недвижимость'
        ],
        'Первичное жильё': [
            'Новостройки и застройщики',
            'Первичное жильё',
            'Почему изменилась цена на первичное жильё',
            'Ипотека для первичного жилья',
            'Цены и динамика первичного жильё'
        ],
        'Вторичное жильё': [
            'Вторичное жильё',
            'Почему изменилась цена на вторичное жильё',
            'Ипотека для вторичного жилья',
            'Цены и динамика вторичного жильё'
        ],
        'Доступность недвижимости': [
            'Доступность жилья',
            'Барьеры для приобретения жилья',
            'Государственные субсидии и льготы на недвижимость'
        ],
    }
    TELEGRAM_CHANNELS = {
        'Недвижимость':
            {
                'approved': [
                    "russianmacro",
                    "domresearch",
                    "okoloCB",
                    "domclick",
                    "ria_realty",
                    "realty_rbc",
                ],
                'not approved': [
                    "Jelezobetonniyzames",
                    "kvadratnymaster",
                    "nedvizha",
                    "belaya_kaska",
                    "propertyinsider",
                    "cian_realtor",
                    "avito_re_pro",
                    "ipotekahouse",
                    "filatofff",
                    "pro_smarent",
                    "Leonid_Rysev",
                    "pataninnews",
                    "rudakov_broker",
                ]
            },
        'Цены на недвижимость':
            {
                'approved': [
                    "russianmacro",
                    "domresearch",
                    "okoloCB",
                    "domclick",
                    "ria_realty",
                    "realty_rbc",
                ],
                'not approved': [
                    "Jelezobetonniyzames",
                    "kvadratnymaster",
                    "nedvizha",
                    "belaya_kaska",
                    "propertyinsider",
                    "cian_realtor",
                    "avito_re_pro",
                    "ipotekahouse",
                    "filatofff",
                    "pro_smarent",
                    "Leonid_Rysev",
                    "pataninnews",
                    "rudakov_broker",
                ]
            },
        'Первичное жильё':
            {
                'approved': [
                    "russianmacro",
                    "domresearch",
                    "okoloCB",
                    "domclick",
                    "ria_realty",
                    "realty_rbc",
                ],
                'not approved': [
                    "Jelezobetonniyzames",
                    "kvadratnymaster",
                    "nedvizha",
                    "belaya_kaska",
                    "propertyinsider",
                    "cian_realtor",
                    "avito_re_pro",
                    "ipotekahouse",
                    "filatofff",
                    "pro_smarent",
                    "Leonid_Rysev",
                    "pataninnews",
                    "rudakov_broker",
                ]
            },
        'Вторичное жильё':
            {
                'approved': [
                    "russianmacro",
                    "domresearch",
                    "okoloCB",
                    "domclick",
                    "ria_realty",
                    "realty_rbc",
                ],
                'not approved': [
                    "Jelezobetonniyzames",
                    "kvadratnymaster",
                    "nedvizha",
                    "belaya_kaska",
                    "propertyinsider",
                    "cian_realtor",
                    "avito_re_pro",
                    "ipotekahouse",
                    "filatofff",
                    "pro_smarent",
                    "Leonid_Rysev",
                    "pataninnews",
                    "rudakov_broker",
                ]
            },
        'Доступность недвижимости':
            {
                'approved': [
                    "russianmacro",
                    "domresearch",
                    "okoloCB",
                    "domclick",
                    "ria_realty",
                    "realty_rbc",
                ],
                'not approved': [
                    "Jelezobetonniyzames",
                    "kvadratnymaster",
                    "nedvizha",
                    "belaya_kaska",
                    "propertyinsider",
                    "cian_realtor",
                    "avito_re_pro",
                    "ipotekahouse",
                    "filatofff",
                    "pro_smarent",
                    "Leonid_Rysev",
                    "pataninnews",
                    "rudakov_broker",
                ]
            }

    }
    # Настройки хранения
    OUTPUT_DIR = "outputs_data"
    # OUTPUT_ABS_DIR = os.path.abspath(OUTPUT_DIR)
    OUTPUT_ABS_DIR = Path(__file__).resolve().parent.parent
    OUTPUT_DIR_PROCESSED = os.path.join(OUTPUT_ABS_DIR, OUTPUT_DIR, "processed")
    OUTPUT_DIR_RAW = os.path.join(OUTPUT_ABS_DIR, OUTPUT_DIR, "raw")
    OUTPUT_DIR_TOPICS = os.path.join(OUTPUT_ABS_DIR, OUTPUT_DIR, "topics")
    OUTPUT_DIR_CLUSTERS = os.path.join(OUTPUT_ABS_DIR, OUTPUT_DIR, "clusters")


settings = Settings()
